[{"eventName":"Treehouse Wearhouse","eventType":"Volunteer","eventCategory":"Retail","location":"{'lat':47.583922, 'long':-122.301288}","dateTime":"05/06/2017 ","description":"Join us in the Treehouse Wearhouse, a unique store where foster children shop for free for new and used clothing and other essentials. We will be sorting, tagging and restocking merchandise, as we ready the store for shopping days. "},
{"eventName":"Fremont Fair Postering","eventType":"Volunteer","eventCategory":"Postering","location":"{'lat':47.651808, 'long':-122.354559}","dateTime":"05/08/2017 ","description":"Help us spread the word about Fremont Fair. Fremont Fair is Seattle’s annual kickoff to summer, celebration with over 100,000 guests at the city’s most beloved neighborhood street festival. The weekend features the traditional fair with nearly 400 artists, craft vendors, food booths and more, and the iconic Solstice Parade put on by the Fremont Arts Council – all coming together to celebrate the Fremont neighborhood’s “Delibertas Quirkas” (Freedom to be Peculiar) nature. For this volunteer opportunity, you will be spending two hours walking around a neighborhood and distributing event posters for businesses to display. This is a great way to explore a neighborhood and get outside! Why you are needed: The more people that know about Fremont Solstice and the iconic Solstice Parade, the more people that attend! Age Requirement: 21+ Volunteer Perk: Volunteers will be given drink tickets to the Fremont Fair beer gardens."},
{"eventName":"Seattle Community Farm","eventType":"Volunteer","eventCategory":"Farming","location":"{'lat':47.567720, 'long':-122.297353}","dateTime":"05/13/2017 ","description":"Let’s go help out in the fresh air on 4 acres of historic preserved farmland in South Seattle! There will be no mud pies, we promise, but what there will be is some tending & maintaining of Lettuce Link’s Giving Garden."},
{"eventName":"Meal Making at Fare Start","eventType":"Volunteer","eventCategory":"Food Service","location":"{'lat':47.567720, 'long':-122.297353}","dateTime":"05/14/2017 ","description":"This is a hands-on kitchen opportunity. Come prepared to chop, stir, and get a little messy. The group will be guided by FareStart's trained chef so cooking skills are not required but participants should be comfortable using knives and other kitchen equipment as instructed."},
{"eventName":"Comfort Kit Assembly","eventType":"Volunteer","eventCategory":"Community","location":"{'lat':47.567720, 'long':-122.297353}","dateTime":"05/16/2017 ","description":"Assemble comfort kits that include items like puzzle books, soft socks, playing cards and warm hats. These kits will be distributed through the Leukemia & Lymphoma Society’s network of hospitals in Seattle. This event is dedicated to the memory of Michele Messler who lost her battle to cancer in March of 2017."},
{"eventName":"The Gauntlet","eventType":"Volunteer","eventCategory":"Social","location":"{'lat':47.567720, 'long':-122.297353}","dateTime":"05/21/2017 ","description":"The Gauntlet is Mox Boarding House's huge 'fun'draiser. Each year, the event raises over $70k for its chosen charity. In this gaming tournament, teams of four, from local community groups and games industry businesses, will raise donations for Treehouse. These donations will unlock power-ups to aid them as they compete in a series of table top games to win glory, and victoriously hoist the Gauntlet! This event is produced by ENGAGE - Mox Boarding House’s charitable giving program. Volunteer Perk: Volunteers will get an invite to the post-event offsite after party."},
{"eventName":"Chicken Soup Brigade","eventType":"Volunteer","eventCategory":"Foo Service","location":"{'lat':47.567720, 'long':-122.297353}","dateTime":"05/10/2017 ","description":"Assemble comfort kits that include items like puzzle books, soft socks, playing cards and warm hats. These kits will be distributed through the Leukemia & Lymphoma Society’s network of hospitals in Seattle. This event is dedicated to the memory of Michele Messler who lost her battle to cancer in March of 2017."},
{"eventName": "NorthWest Folklife Fest","eventType": "Volunteer", "eventCategory": "Community", "location":"{'lat':47.583922, 'long':-122.301288}", "dateTime": "05/26/17", "description": "This event is the nation’s largest community-powered arts festival and you’re needed in the beer gardens! This year’s event will host four beer gardens and will be introducing the first PNW Craft Beer Festival highlighting the best beer the northwest has to offer. During your volunteer shift you will be pouring beer and helping with other event related tasks in the beer garden areas."},
{"eventName": "Recharge","eventType": "Volunteer", "eventCategory": "Lifestyle", "location":"{'lat':47.583922, 'long':-122.301288}", "dateTime": "05/21/17", "description": "Relax. Release. RECHARGE.  RECHARGE is a monthly self-care space for people of color. Stillness is necessary, especially after sustained grief, rage, and defiant joy. This space is for recharging our physical, mental and spiritual energies. "},
{"eventName": "Feed the Homeless","eventType": "Volunteer", "eventCategory": "Food Service", "location":"{'lat':47.583922, 'long':-122.301288}", "dateTime": "05/07/17", "description": "Come out on Sunday to serve food to those in need of a meal in Seattle.  We meet every Sunday at 1pm with the exception of the 3rd Sunday which is at 12pm. Set up the meal site by arranging tables and carrying supplies from the van.  Serve food/drinks or manage distribution of clothing and toiletries.  Help clean up after the serve.  Make a donation"},
{"eventName": "Search and Rescue","eventType": "Volunteer", "eventCategory": "Community", "location":"{'lat':47.583922, 'long':-122.301288}", "dateTime": "05/02/17", "description": "Union Gospel Mission has a search and rescue of humans in vulnerable situations.  The vans drive into the darkest places in King County whenever there are supplies to handout. As a volunteer, you'll first ask men and women you meet if they would like to come into the Mission and sleep.  If they don't chose to come, you'll give them a warm blacket, foot, a hot drink and any other supplies you have on hand that night. Must be 15 years or older with parent. "},
{"eventName": "Yoga For Men","eventType": "Volunteer", "eventCategory": "Lifestyle", "location":"{'lat':47.583922, 'long':-122.301288}", "dateTime": "05/14/17", "description": "Volunteer to stretch your body at this free yoga class for men.  Giving means learning to be an awesome receiver.  Velocity Dance Center. "},
{"eventName": "Get Dirty at Marra Farm","eventType": "Volunteer", "eventCategory": "Community", "location":"{'lat':47.583922, 'long':-122.301288}", "dateTime": "05/10/17", "description": "Marra Farm is an urban community farm that engages the community in sustainable organic gardening provides nutrition & gardening education & enhances local food security. The farm helps to provide to senior lunch programs through the Providence Regina House Food Bank, Mien senior citizens, and Concord Elementary School students and their families."},
{"eventName": "Get out the Vote","eventType": "Volunteer", "eventCategory": "Political", "location":"{'lat':47.583922, 'long':-122.301288}", "dateTime": "05/02/17", "url": "https://www.volunteersignup.org/QCATJ", "description": "Join in calling community members and helping them to register to vote and reminding them to vote in the next election.  Sometimes a personal contact can make a difference in a person choosing to take action.   Sign up for a phone bank session during the months of May to November.  For two weeks each month, we will make calls to register eligible coters and encourage community voters to get out and vote in primary and general elections.  You will have calling scrpts and training and a light dinner.  Sign up at https://www.volunteersignup.org/QCATJ"},
{"eventName": "Fremont Fair", "eventType": "Volunteer", "eventCategory": "Community", "location":"{'lat':47.583922, 'long':-122.301288}", "dateTime": "06/16/17", "description": "Fremont Fair is Seattle’s annual kickoff to summer, celebration with over 100,000 guests at the city’s most beloved neighborhood street festival. The weekend features the traditional Solstice Fair with nearly 400 artists, craft vendors, food booths and more, and the iconic Solstice Parade put on by the Fremont Arts Council – all coming together to celebrate the Fremont neighborhood’s “Delibertas Quirkas” (Freedom to be Peculiar) nature. Help make this iconic event possible by volunteering.  Perk: Drink tickets for the beer garden.  Gotta be 21 or older for this one."},
{"eventName": "Back to School Kit Assembly","eventType": "Volunteer", "eventCategory": "kids", "location":"{'lat':47.583922, 'long':-122.301288}", "dateTime": "06/18/17", "description": "Help  stuff backpacks full of necessary supplies for kids to go back to school. Each backpack will be available in the Treehouse Wearhouse, a free store where youth in foster care and their caregivers can shop for high-quality essentials, or as part of the student success programs.  Perks include cold beverages and a snack."},
{"eventName": "Kirkland Uncorked","eventType": "Volunteer", "eventCategory": "Community", "location":"{'lat':47.583922, 'long':-122.301288}", "dateTime": "07/14/17", "description": "Kirkland Uncorked is Washington’s summer wine festival. Taking place in scenic Marina Park, the festival is a weekend long celebration of world-class Washington wineries. The festival is split into two parts, a 21+ Tasting Garden and an all ages Street Fair. The Tasting Garden features wine tasting, live music, a Friday Burger Brawl and a Saturday Grill-Off. The Street features a Boat Show, the Uncorked Market, the CityDog Dog Modeling Contest, and a Sunday Food Truck Feast. Volunteers make this event possible!Volunteers for this event will receive event admission, ten tasting tokens, and an official event t-shirt"}]
